# -*- coding:utf-8 -*-
# Anaconda 4.3.0 環境

import numpy
import matplotlib.pyplot as plt

# scikit-learn ライブラリ関連
from sklearn import datasets                            # 

# 自作クラス
import Plot2D
import DataPreProcess


def main():
    print("Enter main()")
    #=============================================================================================
    # 主成分分析 [PCA : Principal Component Analysis] による教師なしデータの次元削除、特徴抽出
    #=============================================================================================

    #====================================================
    #   Data Preprocessing（前処理）
    #====================================================
    #----------------------------------------------------
    #   read & set  data
    #----------------------------------------------------
    

    #====================================================
    #   Learning Process
    #====================================================
    

    #====================================================
    #   汎化性能の評価
    #====================================================

    

    print("Finish main()")
    return

    
if __name__ == '__main__':
     main()
